public class ArrayInopolis1 {
//1.Заполнить массив из двенадца тиэлементов 1,2,...12.
//2.Вывести элементы массива на экран в обратном порядке.
    public static void main(String[] args) {
        int  [] array = {1,2,3,4,5,6,7,8,9,10,11,12};

        for (int i = 11; i>=0;i--){

            System.out.println(array[i]);
        }


    }
}
